import React, { Component } from "react";
import classes from "../../Authorization/Login/css/login.module.css";
import Header from "../../Header/Header";
import LastestNews from "../LatestNewsBlogs/LastestNewsblog";
import "./css/Singleblog.css";
class Singleblog extends Component {
  render() {
    return (
      <React.Fragment>
        <div className={classes.shape1_holder}></div>
        <Header />
        <div className="container mt-5 fonts rtl">
          <h1 className="text-center news nass">خبر ها</h1>
          <div className="row mt-5 w-100 mx-auto">
            <div className="card col p-4 holder-content new-titles h-50">
              <img
                className="img-fluid content-img mb-4"
                src={require("../../../Assets/images/sali.png").default}
                alt="Card image cap"
              />
              <div className="card-body">
                <h4 className="card-text text-justify mb-5 text-p">
                  لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و
                  با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و
                  مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی
                  تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای
                  کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و
                  آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم
                  افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص
                  طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این
                  صورت می توان امید داشت که تمام و دشواری موجود در ارائه
                  راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل
                  حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای
                  موجود طراحی اساسا مورد استفاده قرار گیرد.لورم ایپسوم متن
                  ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از
                  طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون
                  و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز،
                  و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد،
                  کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان
                  جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را
                  برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو
                  در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام
                  و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان
                  رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی
                  سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار
                  گیرد.لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت
                  چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه
                  روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط
                  فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود
                  ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته
                  حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با
                  نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص
                  طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این
                  صورت می توان امید داشت که تمام و دشواری موجود در ارائه
                  راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل
                  حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای
                  موجود طراحی اساسا مورد استفاده قرار گیرد.لورم ایپسوم متن
                  ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از
                  طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون
                  و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز،
                  و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد،
                  کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان
                  جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را
                  برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو
                  در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام
                  و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان
                  رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی
                  سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار
                  گیرد.لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت
                  چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه
                  روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط
                  فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود
                  ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته
                  حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با
                  نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص
                  طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این
                  صورت می توان امید داشت که تمام و دشواری موجود در ارائه
                  راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل
                  حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای
                  موجود طراحی اساسا مورد استفاده قرار گیرد.
                </h4>
              </div>
            </div>
          </div>
          <LastestNews/>
        </div>
       
      </React.Fragment>
    );
  }
}

export default Singleblog;
